posts/python-threading-makes-tasks-parallel.org
#+BEGIN_COMMENT
.. title: Python：怎样用线程将任务并行化？
.. slug: python-threading-makes-tasks-parallel
.. date: 2018-05-13 19:37:29 UTC+08:00
.. tags: python
.. category: 
.. link: 
.. description: 
.. type: text
#+END_COMMENT

如果待处理任务满足：
1. 可拆分，即任务可以被拆分为多个子任务，或任务是多个相同的任务的集合；
2. 任务不是CPU密集型的，如任务涉及到较多IO操作（如文件读取和网络数据处理）


则使用多线程将任务并行运行，能够提高运行效率。

假设待处理的任务为：有很多文件目录，对于每个文件目录，搜索匹配一个给定字符串的文件的所有行（相当于是实现grep的功能）。
则此处子任务为：给定一个目录，搜索匹配一个给定字符串的文件的所有行。总的任务为处理所有目录。

将子任务表示为一个函数T，如下所示：
#+begin_src python :results output
def T(dir, pattern):
  print('searching pattern %s in dir %s' % (pattern, dir))
  ...
#+end_src

* 为每个子任务创建一个线程
要实现并行化，最简单的方法是为每一个子任务创建一个thread，thread处理完后退出。
#+begin_src python :results output
from threading import Thread
from time import sleep

def T(dir, pattern):
  "This is just a stub that simulate a dir operation"
  sleep(1)
  print('searching pattern %s in dir %s' % (pattern, dir))

threads = []
dirs = ['a/b/c', 'a/b/d', 'b/c', 'd/f']
pattern = 'hello'

for dir in dirs:
  thread = Thread(target=T, args=(dir, pattern)) #N#
  thread.start() #N#
  threads.append(thread)

for thread in threads:
  thread.join() #N#

print('Main thread end here')
#+end_src

#+RESULTS:
: searching pattern hello in dir a/b/csearching pattern hello in dir d/f
: searching pattern hello in dir b/c
:  searching pattern hello in dir a/b/d
: 
: Main thread end here

- *1* ：创建一个Thread对象，target参数指定这个thread待执行的函数，args参数指定target函数的输入参数
- *2* ：启动这个thread。 T(dir, pattern)将被调用
- *3* ：等待，直到这个thread结束。整个for循环表示主进程会等待所有子线程结束后再退出



程序的运行结果为：
#+BEGIN_SRC text
searching pattern hello in dir a/b/csearching pattern hello in dir d/f
searching pattern hello in dir b/c
 searching pattern hello in dir a/b/d

Main thread end here
#+END_SRC
可以看出由于线程是并行运行的，部分输出会交叠。但主进程的打印总在最后。



以上例子中对于每个dir都需要创建一个thread。如果dir的数目较多，则会创建太多的thread，影响运行效率。
较好的方式是限制总线程的数目。

* 限制线程数目
  可以使用信号量（semaphore）来限制同时运行的最大线程数目。如下所示：
  #+begin_src python :results output
  from threading import Thread, BoundedSemaphore
  from time import sleep

  def T(dir, pattern):
    "This is just a stub that simulate a dir operation"
    sleep(1)
    print('searching pattern %s in dir %s' % (pattern, dir))

  threads = []
  dirs = ['a/b/c', 'a/b/d', 'b/c', 'd/f']
  pattern = 'hello'

  maxjobs = BoundedSemaphore(2) #N#
  def wrapper(dir, pattern):
    T(dir, pattern)
    maxjobs.release() #N#

  for dir in dirs:
    maxjobs.acquire() #N#
    thread = Thread(target=wrapper, args=(dir, pattern))
    thread.start()
    threads.append(thread)

  for thread in threads:
    thread.join() 

  print('Main thread end here')
  #+end_src

  - *1* ：创建一个有2个资源的信号量。一个信号量代表总的可用的资源数目，这里表示同时运行的最大线程数目为2。
  - *2* ：在线程结束时释放资源。运行在子线程中。
  - *3* ：在启动一个线程前，先获取一个资源。如果当前已经有2个线程在运行，则会阻塞，直到其中一个线程结束。
    运行在主线程中。


  当限制了最大运行线程数为2后，由于只有2个线程同时运行，程序的输出更加有序，几乎总是为：
  #+BEGIN_SRC text
  searching pattern hello in dir a/b/c
  searching pattern hello in dir a/b/d
  searching pattern hello in dir b/c
  searching pattern hello in dir d/f
  Main thread end here
  #+END_SRC


  以上实现中为每个子任务创建一个线程进行处理，然后通过信号量限制同时运行的线程的数目。如果子任务很多，这种方法会创建太多的线程。更好的方法 是使用线程池。

  
