posts/python-threading-makes-tasks-parallel/index.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="UTF-8">
<meta name="viewport" content="width=device-width, initial-scale=1.0">
<title>Python：怎样用线程将任务并行化？ | Astropeak</title>
<link rel="stylesheet" href="https://fonts.googleapis.com/css?family=Droid+Sans+Mono%7CLibre+Baskerville%7CMontserrat%7CPlayfair+Display">
<link rel="stylesheet" href="../../assets/css/libretto_styles.css">
<link href="../../assets/css/custom.css" rel="stylesheet" type="text/css">
</head>
<body>
    <!-- Navigation bar -->
    <header class="nav-bar"><div class="site-branding">
            <h1 class="site-title">
                <a href="https://astropeak.github.io/" title="Astropeak" rel="home">Astropeak</a>
            </h1>
        </div>
        <nav class="site-navigation" role="navigation"><div class="menu-toggle">
                <span class="mobile-site-title">Astropeak</span>
            </div>
            <ul class="menu">
<li><a href="../../archive.html">Archive</a></li>
                    <li><a href="../../categories/">Tags</a></li>
                    <li><a href="../../rss.xml">RSS feed</a></li>
                    <li><a href="http://github.com/astropeak">Github</a></li>
            </ul></nav></header><!-- Page Header --><div class="title-block post-format-icon-pin">
        <div class="entry-meta">
            <span class="posted-on">
                Posted on <a href="." rel="bookmark">May 13, 2018</a>
            </span>
        </div>
        <h1>Python：怎样用线程将任务并行化？</h1>
    </div>

        <!-- Page Content -->
    <div class="site-content" role="main">
        <article class="format-standard libretto-long-form"><div class="entry-content">
                <p>
如果待处理任务满足：
</p>
<ol class="org-ol">
<li>可拆分，即任务可以被拆分为多个子任务，或任务是多个相同的任务的集合；
</li>
<li>任务不是CPU密集型的，如任务涉及到较多IO操作（如文件读取和网络数据处理）
</li>
</ol>
<p>
则使用多线程将任务并行运行，能够提高运行效率。
</p>

<p>
假设待处理的任务为：有很多文件目录，对于每个文件目录，搜索匹配一个给定字符串的文件的所有行（相当于是实现grep的功能）。
则此处子任务为：给定一个目录，搜索匹配一个给定字符串的文件的所有行。总的任务为处理所有目录。
</p>

<p>
将子任务表示为一个函数T，如下所示：
</p>
<div class="highlight"><pre>
<span></span><span class="k">def</span> <span class="nf">T</span><span class="p">(</span><span class="nb">dir</span><span class="p">,</span> <span class="n">pattern</span><span class="p">):</span>
  <span class="k">print</span><span class="p">(</span><span class="s1">'searching pattern </span><span class="si">%s</span><span class="s1"> in dir </span><span class="si">%s</span><span class="s1">'</span> <span class="o">%</span> <span class="p">(</span><span class="n">pattern</span><span class="p">,</span> <span class="nb">dir</span><span class="p">))</span>
  <span class="o">...</span>
</pre></div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">为每个子任务创建一个线程</h2>
<div class="outline-text-2" id="text-1">
<p>
要实现并行化，最简单的方法是为每一个子任务创建一个thread，thread处理完后退出。
</p>
<div class="highlight"><pre>
<span></span><span class="kn">from</span> <span class="nn">threading</span> <span class="kn">import</span> <span class="n">Thread</span>
<span class="kn">from</span> <span class="nn">time</span> <span class="kn">import</span> <span class="n">sleep</span>

<span class="k">def</span> <span class="nf">T</span><span class="p">(</span><span class="nb">dir</span><span class="p">,</span> <span class="n">pattern</span><span class="p">):</span>
  <span class="s2">"This is just a stub that simulate a dir operation"</span>
  <span class="n">sleep</span><span class="p">(</span><span class="mi">1</span><span class="p">)</span>
  <span class="k">print</span><span class="p">(</span><span class="s1">'searching pattern </span><span class="si">%s</span><span class="s1"> in dir </span><span class="si">%s</span><span class="s1">'</span> <span class="o">%</span> <span class="p">(</span><span class="n">pattern</span><span class="p">,</span> <span class="nb">dir</span><span class="p">))</span>

<span class="n">threads</span> <span class="o">=</span> <span class="p">[]</span>
<span class="n">dirs</span> <span class="o">=</span> <span class="p">[</span><span class="s1">'a/b/c'</span><span class="p">,</span> <span class="s1">'a/b/d'</span><span class="p">,</span> <span class="s1">'b/c'</span><span class="p">,</span> <span class="s1">'d/f'</span><span class="p">]</span>
<span class="n">pattern</span> <span class="o">=</span> <span class="s1">'hello'</span>

<span class="k">for</span> <span class="nb">dir</span> <span class="ow">in</span> <span class="n">dirs</span><span class="p">:</span>
  <span class="n">thread</span> <span class="o">=</span> <span class="n">Thread</span><span class="p">(</span><span class="n">target</span><span class="o">=</span><span class="n">T</span><span class="p">,</span> <span class="n">args</span><span class="o">=</span><span class="p">(</span><span class="nb">dir</span><span class="p">,</span> <span class="n">pattern</span><span class="p">))</span> <span class="c1"></span>  <span class="numberCircle unselectable">1</span>
  <span class="n">thread</span><span class="o">.</span><span class="n">start</span><span class="p">()</span> <span class="c1"></span>  <span class="numberCircle unselectable">2</span>
  <span class="n">threads</span><span class="o">.</span><span class="n">append</span><span class="p">(</span><span class="n">thread</span><span class="p">)</span>

<span class="k">for</span> <span class="n">thread</span> <span class="ow">in</span> <span class="n">threads</span><span class="p">:</span>
  <span class="n">thread</span><span class="o">.</span><span class="n">join</span><span class="p">()</span> <span class="c1"></span>  <span class="numberCircle unselectable">3</span>

<span class="k">print</span><span class="p">(</span><span class="s1">'Main thread end here'</span><span class="p">)</span>
</pre></div>

<ul class="org-ul">
<li>
<b>1</b> ：创建一个Thread对象，target参数指定这个thread待执行的函数，args参数指定target函数的输入参数
</li>
<li>
<b>2</b> ：启动这个thread。 T(dir, pattern)将被调用
</li>
<li>
<b>3</b> ：等待，直到这个thread结束。整个for循环表示主进程会等待所有子线程结束后再退出
</li>
</ul>
<p>
程序的运行结果为：
</p>
<div class="highlight"><pre>
<span></span>searching pattern hello in dir a/b/csearching pattern hello in dir d/f
searching pattern hello in dir b/c
 searching pattern hello in dir a/b/d

Main thread end here
</pre></div>
<p>
可以看出由于线程是并行运行的，部分输出会交叠。但主进程的打印总在最后。
</p>



<p>
以上例子中对于每个dir都需要创建一个thread。如果dir的数目较多，则会创建太多的thread，影响运行效率。
较好的方式是限制总线程的数目。
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">限制线程数目</h2>
<div class="outline-text-2" id="text-2">
<p>
可以使用信号量（semaphore）来限制同时运行的最大线程数目。如下所示：
</p>
<div class="highlight"><pre>
<span></span><span class="kn">from</span> <span class="nn">threading</span> <span class="kn">import</span> <span class="n">Thread</span><span class="p">,</span> <span class="n">BoundedSemaphore</span>
<span class="kn">from</span> <span class="nn">time</span> <span class="kn">import</span> <span class="n">sleep</span>

<span class="k">def</span> <span class="nf">T</span><span class="p">(</span><span class="nb">dir</span><span class="p">,</span> <span class="n">pattern</span><span class="p">):</span>
  <span class="s2">"This is just a stub that simulate a dir operation"</span>
  <span class="n">sleep</span><span class="p">(</span><span class="mi">1</span><span class="p">)</span>
  <span class="k">print</span><span class="p">(</span><span class="s1">'searching pattern </span><span class="si">%s</span><span class="s1"> in dir </span><span class="si">%s</span><span class="s1">'</span> <span class="o">%</span> <span class="p">(</span><span class="n">pattern</span><span class="p">,</span> <span class="nb">dir</span><span class="p">))</span>

<span class="n">threads</span> <span class="o">=</span> <span class="p">[]</span>
<span class="n">dirs</span> <span class="o">=</span> <span class="p">[</span><span class="s1">'a/b/c'</span><span class="p">,</span> <span class="s1">'a/b/d'</span><span class="p">,</span> <span class="s1">'b/c'</span><span class="p">,</span> <span class="s1">'d/f'</span><span class="p">]</span>
<span class="n">pattern</span> <span class="o">=</span> <span class="s1">'hello'</span>

<span class="n">maxjobs</span> <span class="o">=</span> <span class="n">BoundedSemaphore</span><span class="p">(</span><span class="mi">2</span><span class="p">)</span> <span class="c1"></span>  <span class="numberCircle unselectable">1</span>
<span class="k">def</span> <span class="nf">wrapper</span><span class="p">(</span><span class="nb">dir</span><span class="p">,</span> <span class="n">pattern</span><span class="p">):</span>
  <span class="n">T</span><span class="p">(</span><span class="nb">dir</span><span class="p">,</span> <span class="n">pattern</span><span class="p">)</span>
  <span class="n">maxjobs</span><span class="o">.</span><span class="n">release</span><span class="p">()</span> <span class="c1"></span>  <span class="numberCircle unselectable">2</span>

<span class="k">for</span> <span class="nb">dir</span> <span class="ow">in</span> <span class="n">dirs</span><span class="p">:</span>
  <span class="n">maxjobs</span><span class="o">.</span><span class="n">acquire</span><span class="p">()</span> <span class="c1"></span>  <span class="numberCircle unselectable">3</span>
  <span class="n">thread</span> <span class="o">=</span> <span class="n">Thread</span><span class="p">(</span><span class="n">target</span><span class="o">=</span><span class="n">wrapper</span><span class="p">,</span> <span class="n">args</span><span class="o">=</span><span class="p">(</span><span class="nb">dir</span><span class="p">,</span> <span class="n">pattern</span><span class="p">))</span>
  <span class="n">thread</span><span class="o">.</span><span class="n">start</span><span class="p">()</span>
  <span class="n">threads</span><span class="o">.</span><span class="n">append</span><span class="p">(</span><span class="n">thread</span><span class="p">)</span>

<span class="k">for</span> <span class="n">thread</span> <span class="ow">in</span> <span class="n">threads</span><span class="p">:</span>
  <span class="n">thread</span><span class="o">.</span><span class="n">join</span><span class="p">()</span> 

<span class="k">print</span><span class="p">(</span><span class="s1">'Main thread end here'</span><span class="p">)</span>
</pre></div>

<ul class="org-ul">
<li>
<b>1</b> ：创建一个有2个资源的信号量。一个信号量代表总的可用的资源数目，这里表示同时运行的最大线程数目为2。
</li>
<li>
<b>2</b> ：在线程结束时释放资源。运行在子线程中。
</li>
<li>
<b>3</b> ：在启动一个线程前，先获取一个资源。如果当前已经有2个线程在运行，则会阻塞，直到其中一个线程结束。
运行在主线程中。
</li>
</ul>
<p>
当限制了最大运行线程数为2后，由于只有2个线程同时运行，程序的输出更加有序，几乎总是为：
</p>
<div class="highlight"><pre>
<span></span>searching pattern hello in dir a/b/c
searching pattern hello in dir a/b/d
searching pattern hello in dir b/c
searching pattern hello in dir d/f
Main thread end here
</pre></div>


<p>
以上实现中为每个子任务创建一个线程进行处理，然后通过信号量限制同时运行的线程的数目。如果子任务很多，这种方法会创建太多的线程。更好的方法 是使用线程池。
</p>
</div>
</div>
