posts/python-threading-makes-tasks-parallel.org
* 使用线程池（Thread Pool）
  即预先创建一定数目的线程，形成一个线程池。每个线程持续处理多个子任务（而不是处理一个就退出）。这样做的好处是：创建的线程数目会比较固定。

  那么，每个线程处理哪些子任务呢？一种方法为：预先将所有子任务均分给每个线程。如下所示：
  #+begin_src python :results output
  from threading import Thread
  from time import sleep

  def T(dir, pattern):
    "This is just a stub that simulate a dir operation"
    sleep(1)
    print('searching pattern %s in dir %s' % (pattern, dir))

  dirs = ['a/b/c', 'a/b/d', 'b/c', 'd/f']
  pattern = 'hello'

  def wrapper(dirs, pattern): #N#
    for dir in dirs:
      T(dir, pattern)

  threadsPool = [ #N#
    Thread(target=wrapper, args=(dirs[0:2], pattern)),
    Thread(target=wrapper, args=(dirs[2:], pattern)),
  ]

  for thread in threadsPool: #N#
    thread.start()

  for thread in threadsPool:
    thread.join()

  print('Main thread end here')
  #+end_src
  - *1* ：这个函数能够处理多个dir，将作为线程的target函数
  - *2* ：创建一个有2个线程的线程池。并事先分配子任务给每个线程。线程1处理前两个dir，线程2处理后两个dir
  - *3* ：启动线程池中所有线程


  程序的输出结果为：
  #+BEGIN_SRC text
  searching pattern hello in dir a/b/csearching pattern hello in dir b/c

  searching pattern hello in dir d/f
   searching pattern hello in dir a/b/d
  Main thread end here
  #+END_SRC


  这种方法存在以下问题：
  1. 子任务分配可能不均。导致每个线程运行时间差别可能较大，则整体运行时长可能被拖长
  2. 只能处理所有子任务都预先知道的情况，无法处理子任务实时出现的情况
     
     
  如果有一种方法，能够让线程知道当前所有的待处理子任务，线程一旦空闲，便可以从中获取一个任务进行处理，则以上问题都可以解决。任务队列便是解决方案。

* 使用消息队列
  可以使用Queue实现一个任务队列，用于在线程间传递子任务。主线程将所有待处理子任务放置在队列中，子线程从队列中获取子任务去处理。
  如下所有（注：以下代码只运行于Python 2，因为Queue只存在于Python 2） ：

  #+begin_src python :results output
  from threading import Thread
  from time import sleep
  import Queue

  def T(dir, pattern):
    "This is just a stub that simulate a dir operation"
    sleep(1)
    print('searching pattern %s in dir %s' % (pattern, dir))

  dirs = ['a/b/c', 'a/b/d', 'b/c', 'd/f']
  pattern = 'hello'

  taskQueue = Queue.Queue() #N#

  def wrapper():
    while True:
      try:
        dir = taskQueue.get(True, 0.1) #N#
        T(dir, pattern)
      except Queue.Empty:
          continue

  threadsPool = [Thread(target=wrapper) for i in range(2)] #N#

  for thread in threadsPool: 
    thread.start()  #N#

  for dir in dirs:
    taskQueue.put(dir) #N#

  for thread in threadsPool:
    thread.join()
  print('Main thread end here')
  #+end_src
  - *1* ：创建一个任务队列
  - *2* ：子线程从任务队列中获取一个任务。第一个参数为True，表示如果没有任务，会等待。第二个参数表示最长等待0.1秒
    如果在0.1秒后仍然没有任务，则会抛出一个Queue.Empty的异常
  - *3* ：创建有2个线程的线程池。注意target函数wrapper没有任何参数
  - *4* ：启动所有线程
  - *5* ：主线程将所有子任务放置在任务队列中，以供子线程获取处理。由于子线程已经被启动，则子线程会立即获取到任务并处理


  程序的输出为：
  #+BEGIN_SRC text
  searching pattern hello in dir a/b/c
  searching pattern hello in dir a/b/d
  searching pattern hello in dir b/c
   searching pattern hello in dir d/f
  #+END_SRC

  从中可以看出主进程的打印结果并没有出来，程序会一直运行，而不退出。这个问题的原因是：目前的实现中，子线程为一个无限循环，
  因此其永远不会终止。因此，必须有一种机制来结束子进程。

  
