posts/python-threading-makes-tasks-parallel/index.html


<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">使用线程池（Thread Pool）</h2>
<div class="outline-text-2" id="text-3">
<p>
即预先创建一定数目的线程，形成一个线程池。每个线程持续处理多个子任务（而不是处理一个就退出）。这样做的好处是：创建的线程数目会比较固定。
</p>

<p>
那么，每个线程处理哪些子任务呢？一种方法为：预先将所有子任务均分给每个线程。如下所示：
</p>
<div class="highlight"><pre>
<span></span><span class="kn">from</span> <span class="nn">threading</span> <span class="kn">import</span> <span class="n">Thread</span>
<span class="kn">from</span> <span class="nn">time</span> <span class="kn">import</span> <span class="n">sleep</span>

<span class="k">def</span> <span class="nf">T</span><span class="p">(</span><span class="nb">dir</span><span class="p">,</span> <span class="n">pattern</span><span class="p">):</span>
  <span class="s2">"This is just a stub that simulate a dir operation"</span>
  <span class="n">sleep</span><span class="p">(</span><span class="mi">1</span><span class="p">)</span>
  <span class="k">print</span><span class="p">(</span><span class="s1">'searching pattern </span><span class="si">%s</span><span class="s1"> in dir </span><span class="si">%s</span><span class="s1">'</span> <span class="o">%</span> <span class="p">(</span><span class="n">pattern</span><span class="p">,</span> <span class="nb">dir</span><span class="p">))</span>

<span class="n">dirs</span> <span class="o">=</span> <span class="p">[</span><span class="s1">'a/b/c'</span><span class="p">,</span> <span class="s1">'a/b/d'</span><span class="p">,</span> <span class="s1">'b/c'</span><span class="p">,</span> <span class="s1">'d/f'</span><span class="p">]</span>
<span class="n">pattern</span> <span class="o">=</span> <span class="s1">'hello'</span>

<span class="k">def</span> <span class="nf">wrapper</span><span class="p">(</span><span class="n">dirs</span><span class="p">,</span> <span class="n">pattern</span><span class="p">):</span> <span class="c1"></span>  <span class="numberCircle unselectable">1</span>
  <span class="k">for</span> <span class="nb">dir</span> <span class="ow">in</span> <span class="n">dirs</span><span class="p">:</span>
    <span class="n">T</span><span class="p">(</span><span class="nb">dir</span><span class="p">,</span> <span class="n">pattern</span><span class="p">)</span>

<span class="n">threadsPool</span> <span class="o">=</span> <span class="p">[</span> <span class="c1"></span>  <span class="numberCircle unselectable">2</span>
  <span class="n">Thread</span><span class="p">(</span><span class="n">target</span><span class="o">=</span><span class="n">wrapper</span><span class="p">,</span> <span class="n">args</span><span class="o">=</span><span class="p">(</span><span class="n">dirs</span><span class="p">[</span><span class="mi">0</span><span class="p">:</span><span class="mi">2</span><span class="p">],</span> <span class="n">pattern</span><span class="p">)),</span>
  <span class="n">Thread</span><span class="p">(</span><span class="n">target</span><span class="o">=</span><span class="n">wrapper</span><span class="p">,</span> <span class="n">args</span><span class="o">=</span><span class="p">(</span><span class="n">dirs</span><span class="p">[</span><span class="mi">2</span><span class="p">:],</span> <span class="n">pattern</span><span class="p">)),</span>
<span class="p">]</span>

<span class="k">for</span> <span class="n">thread</span> <span class="ow">in</span> <span class="n">threadsPool</span><span class="p">:</span> <span class="c1"></span>  <span class="numberCircle unselectable">3</span>
  <span class="n">thread</span><span class="o">.</span><span class="n">start</span><span class="p">()</span>

<span class="k">for</span> <span class="n">thread</span> <span class="ow">in</span> <span class="n">threadsPool</span><span class="p">:</span>
  <span class="n">thread</span><span class="o">.</span><span class="n">join</span><span class="p">()</span>

<span class="k">print</span><span class="p">(</span><span class="s1">'Main thread end here'</span><span class="p">)</span>
</pre></div>
<ul class="org-ul">
<li>
<b>1</b> ：这个函数能够处理多个dir，将作为线程的target函数
</li>
<li>
<b>2</b> ：创建一个有2个线程的线程池。并事先分配子任务给每个线程。线程1处理前两个dir，线程2处理后两个dir
</li>
<li>
<b>3</b> ：启动线程池中所有线程
</li>
</ul>
<p>
程序的输出结果为：
</p>
<div class="highlight"><pre>
<span></span>searching pattern hello in dir a/b/csearching pattern hello in dir b/c

searching pattern hello in dir d/f
 searching pattern hello in dir a/b/d
Main thread end here
</pre></div>


<p>
这种方法存在以下问题：
</p>
<ol class="org-ol">
<li>子任务分配可能不均。导致每个线程运行时间差别可能较大，则整体运行时长可能被拖长
</li>
<li>只能处理所有子任务都预先知道的情况，无法处理子任务实时出现的情况
</li>
</ol>
<p>
如果有一种方法，能够让线程知道当前所有的待处理子任务，线程一旦空闲，便可以从中获取一个任务进行处理，则以上问题都可以解决。任务队列便是解决方案。
</p>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">使用消息队列</h2>
<div class="outline-text-2" id="text-4">
<p>
可以使用Queue实现一个任务队列，用于在线程间传递子任务。主线程将所有待处理子任务放置在队列中，子线程从队列中获取子任务去处理。
如下所有（注：以下代码只运行于Python 2，因为Queue只存在于Python 2） ：
</p>

<div class="highlight"><pre>
<span></span><span class="kn">from</span> <span class="nn">threading</span> <span class="kn">import</span> <span class="n">Thread</span>
<span class="kn">from</span> <span class="nn">time</span> <span class="kn">import</span> <span class="n">sleep</span>
<span class="kn">import</span> <span class="nn">Queue</span>

<span class="k">def</span> <span class="nf">T</span><span class="p">(</span><span class="nb">dir</span><span class="p">,</span> <span class="n">pattern</span><span class="p">):</span>
  <span class="s2">"This is just a stub that simulate a dir operation"</span>
  <span class="n">sleep</span><span class="p">(</span><span class="mi">1</span><span class="p">)</span>
  <span class="k">print</span><span class="p">(</span><span class="s1">'searching pattern </span><span class="si">%s</span><span class="s1"> in dir </span><span class="si">%s</span><span class="s1">'</span> <span class="o">%</span> <span class="p">(</span><span class="n">pattern</span><span class="p">,</span> <span class="nb">dir</span><span class="p">))</span>

<span class="n">dirs</span> <span class="o">=</span> <span class="p">[</span><span class="s1">'a/b/c'</span><span class="p">,</span> <span class="s1">'a/b/d'</span><span class="p">,</span> <span class="s1">'b/c'</span><span class="p">,</span> <span class="s1">'d/f'</span><span class="p">]</span>
<span class="n">pattern</span> <span class="o">=</span> <span class="s1">'hello'</span>

<span class="n">taskQueue</span> <span class="o">=</span> <span class="n">Queue</span><span class="o">.</span><span class="n">Queue</span><span class="p">()</span> <span class="c1"></span>  <span class="numberCircle unselectable">1</span>

<span class="k">def</span> <span class="nf">wrapper</span><span class="p">():</span>
  <span class="k">while</span> <span class="bp">True</span><span class="p">:</span>
    <span class="k">try</span><span class="p">:</span>
      <span class="nb">dir</span> <span class="o">=</span> <span class="n">taskQueue</span><span class="o">.</span><span class="n">get</span><span class="p">(</span><span class="bp">True</span><span class="p">,</span> <span class="mf">0.1</span><span class="p">)</span> <span class="c1"></span>  <span class="numberCircle unselectable">2</span>
      <span class="n">T</span><span class="p">(</span><span class="nb">dir</span><span class="p">,</span> <span class="n">pattern</span><span class="p">)</span>
    <span class="k">except</span> <span class="n">Queue</span><span class="o">.</span><span class="n">Empty</span><span class="p">:</span>
	<span class="k">continue</span>

<span class="n">threadsPool</span> <span class="o">=</span> <span class="p">[</span><span class="n">Thread</span><span class="p">(</span><span class="n">target</span><span class="o">=</span><span class="n">wrapper</span><span class="p">)</span> <span class="k">for</span> <span class="n">i</span> <span class="ow">in</span> <span class="nb">range</span><span class="p">(</span><span class="mi">2</span><span class="p">)]</span> <span class="c1"></span>  <span class="numberCircle unselectable">3</span>

<span class="k">for</span> <span class="n">thread</span> <span class="ow">in</span> <span class="n">threadsPool</span><span class="p">:</span> 
  <span class="n">thread</span><span class="o">.</span><span class="n">start</span><span class="p">()</span>  <span class="c1"></span>  <span class="numberCircle unselectable">4</span>

<span class="k">for</span> <span class="nb">dir</span> <span class="ow">in</span> <span class="n">dirs</span><span class="p">:</span>
  <span class="n">taskQueue</span><span class="o">.</span><span class="n">put</span><span class="p">(</span><span class="nb">dir</span><span class="p">)</span> <span class="c1"></span>  <span class="numberCircle unselectable">5</span>

<span class="k">for</span> <span class="n">thread</span> <span class="ow">in</span> <span class="n">threadsPool</span><span class="p">:</span>
  <span class="n">thread</span><span class="o">.</span><span class="n">join</span><span class="p">()</span>
<span class="k">print</span><span class="p">(</span><span class="s1">'Main thread end here'</span><span class="p">)</span>
</pre></div>
<ul class="org-ul">
<li>
<b>1</b> ：创建一个任务队列
</li>
<li>
<b>2</b> ：子线程从任务队列中获取一个任务。第一个参数为True，表示如果没有任务，会等待。第二个参数表示最长等待0.1秒
如果在0.1秒后仍然没有任务，则会抛出一个Queue.Empty的异常
</li>
<li>
<b>3</b> ：创建有2个线程的线程池。注意target函数wrapper没有任何参数
</li>
<li>
<b>4</b> ：启动所有线程
</li>
<li>
<b>5</b> ：主线程将所有子任务放置在任务队列中，以供子线程获取处理。由于子线程已经被启动，则子线程会立即获取到任务并处理
</li>
</ul>
<p>
程序的输出为：
</p>
<div class="highlight"><pre>
<span></span>searching pattern hello in dir a/b/c
searching pattern hello in dir a/b/d
searching pattern hello in dir b/c
 searching pattern hello in dir d/f
</pre></div>

<p>
从中可以看出主进程的打印结果并没有出来，程序会一直运行，而不退出。这个问题的原因是：目前的实现中，子线程为一个无限循环，
因此其永远不会终止。因此，必须有一种机制来结束子进程。
</p>
</div>
</div>
